
# Задание 4: Разделение строки
"""
Создайте строку с текстом "яблоко,банан,вишня".
- Разбейте её на отдельные слова, используя запятую как разделитель.
- Выведите полученный список.
"""
from lesson_4 import food_list

# Ваш код здесь
text = "яблоко,банан,вишня" .split(",")
print(text)

